from steps import get_number_input 
import sys

def first_challenge():
    
    while True:
        number = get_number_input("Введи число от 1 до 9: ")
        
        if 1 <= number <= 5:
            print("Ты прошёл! ")
            break
        elif number == 6:
            print("Я почти тебя поймал...")
            break
        elif 7 <= number <= 9:
            print("Ты проиграл! 💀")
            sys.exit() 
        else:
            print("Выбери число от 1 до 9")

def riddle_challenge():
    print("Теперь тебя ждут три загадки! Ответишь на 2 верно и я тебя пожалею")
    score = 0
    
    answer1 = input("Белый,но не сахар. Пушистый,но не птица. Нет ног, а идёт. ").lower().strip()
    if answer1 == "снег":
        print("Правильно!")
        score += 1
    else:
        print("Неправильно! Правильный ответ: снег")

    answer2 = input("Страус может назвать себя птицей? ").lower().strip()
    if answer2 == "нет":
        print("Правильно!")
        score += 1
    else:
        print("Неправильно! Нет, страусы не умеют разговаривать")

    answer3 = input("Каких камней не бывает в речке? ").lower().strip()
    if answer3 == "сухих":
        print("Правильно!")
        score += 1
    else:
        print("Неправильно! Сухих")
    
    if score < 2:
        print("\nТы проиграл! 💀")
        sys.exit() 
    
    print(f"\nМолодец! Ты набрал {score} очков. Идем дальше.")
    return True

def final_challenge(player_name):
    print("\n[--- ФИНАЛ ---]")
    final = get_number_input("Финал! Введи число от 1 до 9:")
    
    
    if final >= 1 and final <= 7:
        print(f"Поздравляю {player_name}! Ты выиграл! 🏆")
    else:
        print(f"Я тебя съел {player_name}")